In [17]:
from pandas import Series
import pandas as pd

ww2_dict = {'USSR': 8700000, 'Germany': 4300000, 'China': 3000000, 'Japan': 2100000, 'USA': 400000}
WW2_Series = Series(ww2_dict)
#print(WW2_Series)

countries = ['China','Germany','Japan','USA','USSR','Argentina', 'Oman']
obj2 = Series(ww2_dict, index=countries)
print(obj2)

China        3000000.0
Germany      4300000.0
Japan        2100000.0
USA           400000.0
USSR         8700000.0
Argentina          NaN
Oman               NaN
dtype: float64

In [21]:
#Exercise: Give me the countries that are not null as Series
condetion = obj2.notnull() #bollen series
obj2[condetion]

China      3000000.0
Germany    4300000.0
Japan      2100000.0
USA         400000.0
USSR       8700000.0
dtype: float64

In [22]:
obj2[obj2.isnull()]

Series([], dtype: float64)

In [23]:
data = {
    "Names" : ["Fatama", "Sahab","Maryam"],
    "Ages" : [24,25,24],
    "City" : ["Salalah","Marbat","Saada"]
}
data

{'Names': ['Fatama', 'Sahab', 'Maryam'],
 'Ages': [24, 25, 24],
 'City': ['Salalah', 'Marbat', 'Saada']}

In [27]:
df = pd.DataFrame(data)
df

    Names  Ages     City
0  Fatama    24  Salalah
1   Sahab    25   Marbat
2  Maryam    24    Saada

In [28]:
df.index = ["student 1","student 2","student 3"]
df

            Names  Ages     City
student 1  Fatama    24  Salalah
student 2   Sahab    25   Marbat
student 3  Maryam    24    Saada

In [35]:
df.index = ["s1","s2","s3"]
df.rename = ["s1","s2","s3"]

In [36]:
df.replace = ["s1","s2","s3"]
df

     Names  Ages     City
s1  Fatama    24  Salalah
s2   Sahab    25   Marbat
s3  Maryam    24    Saada

In [ ]:
#rename
df = pd.DataFrame(data)
df =  df.rename(index={0: 'student 1', 1: 'student 2', 2:'student 3'})
print(df)

In [29]:
df.loc["student 1"] #get rows and columns by lebels

Names     Fatama
Ages          24
City     Salalah
Name: student 1, dtype: object

In [38]:
df.iloc[0] #by position

Names     Fatama
Ages          24
City     Salalah
Name: s1, dtype: object

In [39]:
df.loc["s1"] #by lebels

Names     Fatama
Ages          24
City     Salalah
Name: s1, dtype: object